content/html/meeting-notes/2012-03-27.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Meeting Notes 2012-03-27</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Meeting Notes 2012-03-27"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-04-25 22:11:25 EDT"/>
<meta name="author" content="Matthew Croop"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="../../css/stylesheet.css" />
<link rel="stylesheet" type="text/css" href="../../css/stylesheet.css" />

</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="sitemap.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Meeting Notes 2012-03-27</h1>


<script type="text/javascript">

  var _gaq = _gaq || [];
  _gaq.push(['_setAccount', 'UA-30426956-1']);
  _gaq.push(['_trackPageview']);

  (function() {
    var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
    ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
    var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
  })();

</script>




<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">The Greater Emacs Community</a></li>
<li><a href="#sec-2">Setup</a></li>
<li><a href="#sec-3">Flymake</a></li>
<li><a href="#sec-4">The Feast</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">The Greater Emacs Community</h2>
<div class="outline-text-2" id="text-1">

<ul>
<li><a href="http://emacsmovies.org/blog/2012/03/24/terminology/">emacsmovies.org</a> is also a fan of <code>M-x zone</code> (as well as
    <code>animate-sequence</code>)
</li>
</ul>

</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Setup</h2>
<div class="outline-text-2" id="text-2">

<ul>
<li>Someone's tree thing is drawn on the whiteboard.
<ul>
<li><b>John</b>: Let's get the schematics out of the way.
</li>
</ul>

</li>
<li>Braunstein, Orderer-Elect of Food, is absent.
<ul>
<li><b>Rafe</b>: Koreana doesn't start taking orders until 5:30.
</li>
<li>Andrew had class then so Rafe submitted the order for him.
</li>
</ul>

</li>
<li>Mish disapproves of the transparent blinds that do not filter the
    sun.
</li>
<li>Mish pushes the potluck back until the last day of emacsclub.
<ul>
<li><b>John</b>: I thought we were doing the potluck today!
</li>
<li><b>Rafe</b>: But I spent so much time on my init file today!
<ul>
<li>Rafe's init file is pretty now.
</li>
<li><b>Mish</b>: It's going to stay pretty until the potluck, though.
</li>
<li><b>Rafe</b>: No it won't. I'm just going to cat things to the end
        of it.
</li>
</ul>

</li>
</ul>

</li>
<li>We have new members, so we all introduce ourselves.
<ul>
<li>Mish introduces himself as the leader.
</li>
<li><b>John</b>: I'm also the president, even though I don't do
      anything.
</li>
<li><b>Zach</b>: I'm Zach.
<ul>
<li>The sunlight is in his hair, unaffected by the transparent
        blinds.
</li>
<li><b>Mish</b>: You look like a god.
</li>
</ul>

</li>
<li>Andrew arrives.
<ul>
<li><b>Rafe</b>: This is Andrew.
</li>
<li><b>Mish</b>: This is Andrew.
</li>
</ul>

</li>
</ul>

</li>
</ul>

</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">Flymake</h2>
<div class="outline-text-2" id="text-3">

<ul>
<li>Mish inquires whether we should set up flymake in C or Java.
<ul>
<li><b>Zach</b>: You have both working?
</li>
<li><b>Mish</b>: I have nothing working.
</li>
</ul>

</li>
<li><b>Mish</b>: Zach will be leading us.
<ul>
<li><b>Zach</b>: Through the Googling.
</li>
</ul>

</li>
<li>We all forage for usable C projects.
<ul>
<li><b>John</b>: I'm going to do this with badbuf.
</li>
</ul>

</li>
<li><b>Zach</b>: I like how there's a pedantic option for the compiler.
<ul>
<li><b>John</b>: <code>-pedantic</code> is extra- <code>-Wall</code>
</li>
</ul>

</li>
<li><b>Mish</b>: There's a flymake for vim, Mr. Vim User.
</li>
<li>Rafe's flymake currently works for Python and LaTeX.
</li>
<li>Zach puts his makefile on pastebin, while marveling at the vast
    extent of pastebin's syntax highlighting options.
<ul>
<li><b>Zach</b>: Did everyone get that address?
</li>
<li>Mish just copied Zach's Makefile off the projector in the time
      it took to put it up on pastebin.
</li>
</ul>

</li>
<li>Mish complains about cross-pollination.
</li>
<li><b>Mish</b>: How do we not know how to global-set-key something? This
    is embarassing.
</li>
<li><b>Zach</b>: What's your Makefile called?
<ul>
<li><b>Andrew</b>: What do you think it's called? Makefile!
</li>
</ul>

</li>
</ul>

</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">The Feast</h2>
<div class="outline-text-2" id="text-4">

<ul>
<li>The utensils and napkins from Koreana are wrapped in rubber
    bands.
<ul>
<li><b>Rafe</b>: They went through painstaking effort to make these.
</li>
</ul>

</li>
<li>Rafe requests it be added to the record that next time we should
    prepare a stock of plates.
<ul>
<li>This time, however, our plates are Koreana container tops.
<ul>
<li><b>Rafe</b>: Here is a plate.
</li>
<li><b>Todun</b>: Thank you.
</li>
</ul>

</li>
<li>Mish gets the real plate.
<ul>
<li><b>Rafe</b>: As our leader, you get the only actual plate.
</li>
</ul>

</li>
</ul>

</li>
<li>The sun shines directly through the highrise rooftop lounges.
</li>
<li><b>Mish</b>: Is everyone here?
<ul>
<li><b>Rafe</b>: I'm here.
</li>
</ul>

</li>
<li>A Jimmy John's platter is proposed for next week's feast.
<ul>
<li><b>Zach</b>: What about a Potbelly platter?
</li>
<li>Whenever someone suggests Jimmy John's, Zach one-ups them.
</li>
</ul>

</li>
<li>As we get kicked out by the 7:15pm group, Mish gathers all his
    belongings.
<ul>
<li><b>Mish</b>: Oh! My dongle!
</li>
</ul>

</li>
</ul>

</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-04-25 22:11:25 EDT</p>
<p class="author">Author: Matthew Croop</p>
<p class="creator">Org version 7.8.09 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
